Revit 2027 API
Element.IsValidType Method
Overload List
Name | Description
IsValidType(ElementId) |  Checks if given type is valid for this element.
IsValidType(Document, ICollection<ElementId>, ElementId) |  Checks if given type is valid for the set of elements.
Top
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace